#include <stdio.h>
#include <string.h>

int main()
{
  int i;
  char word[][80] = 
  {
    "  ****         *    ******          *    ",
    " *    *       *       *           *      ",
    " *         ******* *******    ********** ",
    " *           ****    *   *      *******  ",
    " *           ****  ********     *******  ",
    " *           ****   *****       *******  ",
    " *    *      *  *   *   *       *     *  ",
    "  ****       ****   *****       *******  ",
    ""  //有了这个空串，程序员就不用数上面有多少行字符串了
  };
 
  for(i = 0; strlen(word[i]) != 0; i++)  //显示字符串，直到遇到空串结束
	 printf("%s\n", word[i]);  //word[i]对应第i行的字符串的首地址
  return 0;
}